{
  "id": "TP-0013",
  "title": "Credential Stuffing to Loyalty Point / Gift Card Account Drain",
  "category": "ThreatPath",
  "date": "2026-02-12",
  "author": "FLAME Project",
  "source": "Akamai State of the Internet reports / industry reporting",
  "tlp": "WHITE",
  "summary": "Actors use large-scale credential stuffing (automated testing of stolen username/password pairs from unrelated breaches) against loyalty program portals, bank rewards platforms, and gift card balance-check sites. Successful logins are used to drain stored value — transferring loyalty points to actor-controlled accounts, converting rewards to gift cards, or transferring gift card balances. Loyalty points and gift cards are attractive targets because they're less monitored than bank accounts, rarely have MFA, and can be monetized quickly through resale markets. Akamai reports billions of credential stuffing attempts per year targeting financial services.",
  "body": "## Summary\n\nActors use large-scale credential stuffing (automated testing of stolen username/password pairs from unrelated breaches) against loyalty program portals, bank rewards platforms, and gift card balance-check sites. Successful logins are used to drain stored value — transferring loyalty points to actor-controlled accounts, converting rewards to gift cards, or transferring gift card balances. Loyalty points and gift cards are attractive targets because they're less monitored than bank accounts, rarely have MFA, and can be monetized quickly through resale markets. Akamai reports billions of credential stuffing attempts per year targeting financial services.\n\n## Threat Path Hypothesis\n\n> **Hypothesis**: Actors are conducting automated credential stuffing at scale against loyalty program and rewards platforms to identify accounts with stored value, then draining points/balances through redemption, transfer, or gift card conversion — exploiting weak authentication on \"non-financial\" portals that hold significant monetary value.\n\n**Confidence**: High — Akamai, Shape Security, and PerimeterX document billions of credential stuffing attempts annually.\n**Estimated Impact**: $50 – $5,000 per account (lower individual value, massive volume). Programs lose $1B+ annually to points fraud.\n\n## CFPF Phase Mapping\n\n### Phase 1: Recon\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| CFPF-P1-004: Credential list acquisition | Purchase combo lists (email:password pairs) from dark web markets, sourced from previous data breaches | Credential dumps containing emails associated with loyalty programs |\n| Target portal identification | Identify loyalty programs and rewards platforms with: no MFA, high stored value, transferable points, gift card redemption options | Reconnaissance against login endpoints; API enumeration |\n| Tool/infrastructure setup | Configure credential stuffing tools (OpenBullet, SentryMBA, custom scripts) with target-specific configs, CAPTCHA-solving services, and residential proxy networks | Bulk proxy purchases; CAPTCHA-solving service subscriptions |\n\n### Phase 2: Initial Access\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| CFPF-P2-005: Credential stuffing | Automated testing of millions of credential pairs against target portal. Success rates typically 0.1-2% but yield thousands of valid accounts at scale. | Login attempt velocity spikes; distributed source IPs (residential proxies); high failure-to-success ratio; user-agent anomalies |\n| Valid account access | Successful logins used to check account balances and identify high-value targets for draining | Authenticated sessions with immediate balance-check and no other activity |\n\n### Phase 3: Positioning\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| CFPF-P3-003: Contact info modification | Change email/notification preferences to prevent legitimate account holder from receiving redemption alerts | Contact info changes from new IPs immediately after first login from that IP |\n| Account inventory | Catalog compromised accounts by balance/value; prioritize highest-value for draining | Rapid sequential access to multiple accounts from same IP range; balance-check-only sessions |\n\n### Phase 4: Execution\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| Points transfer | Transfer loyalty points to actor-controlled accounts within the same program | Point transfers to accounts with no relationship to transferring account; bulk transfers from multiple source accounts to single destination |\n| Gift card redemption | Convert loyalty points to digital gift cards (Amazon, Visa, etc.) delivered to actor-controlled email | Gift card redemptions to new/changed email addresses; bulk redemptions across multiple accounts in short window |\n| Stored value transfer | Transfer gift card balances to other cards or mobile payment platforms | Balance transfers from gift card checking portals |\n\n### Phase 5: Monetization\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| Gift card resale | Sell redeemed gift cards on secondary markets (CardCash, Raise, Telegram channels) at 60-80% face value | Gift cards appearing on resale platforms shortly after redemption |\n| Direct purchase | Use redeemed gift cards for purchases of high-resale-value items (electronics, luxury goods) | Shipping addresses different from account addresses |\n| CFPF-P5-003: Crypto conversion | Convert gift card values to cryptocurrency through gift-card-to-crypto exchange services | Gift card codes exchanged on Paxful, Bitrefill, or similar platforms |\n\n## Cross-Framework Mapping\n\n**Group-IB Fraud Matrix technique-level mapping** (corroborated via Group-IB Fraud Intelligence report: \"Credentials Stuffing using BAS\"):\n\n| Group-IB Stage | Techniques Used |\n|---------------|----------------|\n| Reconnaissance | Gather Compromised Account, Buy Compromised Accounts |\n| Resource Development | Anonymity Capabilities |\n| Account Access | Access from Fraudster Device |\n| Defence Evasion | Device Fingerprint Spoofing, Virtual Machines, Geolocation Spoofing, VPN/Proxy/Hosting Services |\n| Monetization | Sale of Compromised Credentials to 3rd Party |\n\n**Notable Group-IB intelligence additions:**\n- **Browser Automation Studio (BAS)** is a primary tooling platform for credential stuffing. BAS functions as a visual IDE for creating stuffing scripts, with integrated CAPTCHA-solving modules, phone verification services, and the ability to compile scripts into standalone executables for distribution to other actors. The BAS ecosystem (Bablosoft) provides purpose-built infrastructure for this attack chain.\n- A critical detection-evasion technique involves **stolen device fingerprint reuse**: actors import legitimate user fingerprints into BAS, making automated login attempts appear to originate from real user devices. This has a secondary victim impact — legitimate users whose fingerprints are reused may be wrongfully blocked by fraud protection systems that flag their device profiles as high-risk.\n- BAS operates on the **Chromium Embedded Framework (CEF)**, which makes its browser behavior closely mimic legitimate Chrome sessions. Detection should focus on browser API inconsistencies, anomalous device characteristics, and behavioral patterns rather than simple user-agent analysis.\n- The credential stuffing supply chain is now industrialized: actors can purchase pre-built BAS configs for specific target websites on darknet markets, lowering the skill barrier for entry.\n\n**MITRE ATT&CK:**\n- T1110.004: Credential Stuffing\n- T1078: Valid Accounts\n- T1657: Financial Theft\n\n## Controls & Mitigations\n\n| Phase | Control | Type |\n|-------|---------|------|\n| P2 | **Implement MFA on loyalty/rewards portals** (even basic SMS MFA dramatically reduces credential stuffing success) | Preventive |\n| P2 | Rate limiting and CAPTCHA on login endpoints; bot detection (device fingerprinting, behavioral analysis) | Preventive |\n| P2 | Credential breach monitoring: proactively reset passwords for accounts whose credentials appear in breach dumps | Preventive |\n| P3 | Alert account holders on email/contact changes and point redemptions | Detective |\n| P4 | Velocity limits on point transfers and gift card redemptions | Preventive |\n| P4 | Flag bulk redemptions from accounts with no prior redemption history | Detective |\n\n## UCFF Alignment\n\n### Required Organizational Maturity for Effective Detection\n\n| UCFF Domain | Minimum Maturity | Key Deliverables for This Threat Path |\n|-------------|-----------------|--------------------------------------|\n| COMMIT | Level 2 (Developing) | Leadership mandate for credential security standards across all customer-facing portals including loyalty/rewards, and investment in bot protection technology |\n| ASSESS | Level 2 (Developing) | Assessment of credential exposure via breach database monitoring, quantification of loyalty program stored value at risk, identification of portals lacking MFA |\n| PLAN | Level 2 (Developing) | Bot mitigation strategy covering rate limiting, CAPTCHA, and device fingerprinting; credential breach monitoring program; MFA enforcement rollout plan for loyalty portals |\n| ACT | Level 3 (Established) | Rate limiting and bot detection on login endpoints, device fingerprinting with BAS/CEF artifact detection, credential breach monitoring with proactive password resets, MFA enforcement on loyalty and rewards portals |\n| MONITOR | Level 3 (Established) | Login failure rate monitoring and velocity anomaly detection, loyalty point redemption pattern analysis, gift card generation velocity tracking, residential proxy and stuffing tool fingerprint alerting |\n| REPORT | Level 2 (Developing) | Breach notification compliance for compromised loyalty accounts, customer credential reset communications, reporting stuffing campaign indicators to industry sharing groups |\n| IMPROVE | Level 2 (Developing) | Tracking credential stuffing attempt trends and success rates over time, updating credential and authentication policies based on evolving tooling (e.g., BAS ecosystem changes) |\n\n### Maturity Levels Reference\n- **Level 1 (Initial):** Ad hoc, reactive fraud management\n- **Level 2 (Developing):** Basic fraud function exists with some defined processes\n- **Level 3 (Established):** Formalized fraud program with proactive capabilities\n- **Level 4 (Advanced):** Data-driven, continuously improving fraud program\n- **Level 5 (Leading):** Industry-leading, predictive fraud management\n\n## Detection Approaches\n\n**WAF / API Gateway — Credential Stuffing Detection**\n```\nFlag traffic where:\n  - Login failure rate from source IP/subnet > 95% AND\n  - Successful logins show immediate balance-check behavior AND\n  - Source uses residential proxy IP ranges AND\n  - User-agent or TLS fingerprint matches known stuffing tools\n```\n\n**Post-Auth — Account Drain Pattern**\n```sql\nSELECT account_id, \n       SUM(points_redeemed) as total_redeemed,\n       COUNT(DISTINCT gift_card_id) as cards_generated,\n       MIN(session_ip) as source_ip\nFROM redemption_log\nWHERE redemption_date >= CURRENT_DATE - INTERVAL '7 days'\nGROUP BY account_id\nHAVING total_redeemed > 10000  -- threshold\n   AND cards_generated > 2\n   AND source_ip NOT IN (SELECT known_ip FROM account_known_ips WHERE account_id = redemption_log.account_id)\nORDER BY total_redeemed DESC;\n```\n\n**Browser Automation Studio (BAS) Detection Indicators**\n```\nFlag sessions where:\n  - Browser fingerprint matches known stolen fingerprint from breach databases AND\n  - Login source IP is residential proxy or VPN AND\n  - Session exhibits automated timing patterns (consistent inter-request intervals)\n  \n  OR\n  \n  - Chromium Embedded Framework (CEF) artifacts detected in browser API responses AND\n  - WebGL/Canvas fingerprint shows inconsistencies with declared user-agent AND\n  - Multiple accounts accessed from same underlying device within short timeframe\n```\n\n## References\n- Akamai: State of the Internet — Credential Stuffing Reports\n- Shape Security (F5): Credential Spill Report\n- Loyalty Security Alliance: Points Fraud Prevention\n- OWASP: Credential Stuffing Prevention Cheat Sheet\n- Group-IB Fraud Intelligence: \"Credentials Stuffing using BAS\" scheme report (BAS tooling analysis, technique-level Fraud Matrix mapping)\n\n## Revision History\n| Date | Author | Change |\n|------|--------|--------|\n| 2026-02-12 | FLAME Project | Initial submission |",
  "sectors": [
    "fintech",
    "banking",
    "cross-sector"
  ],
  "fraud_types": [
    "credential-stuffing",
    "account-takeover"
  ],
  "tags": [
    "loyalty-fraud",
    "rewards-points",
    "gift-card",
    "stored-value",
    "automated-attack",
    "credential-reuse"
  ],
  "cfpf_phases": [
    "P1",
    "P2",
    "P3",
    "P4",
    "P5"
  ],
  "mitre_attack": [
    "T1110.004",
    "T1078",
    "T1657"
  ],
  "ft3_tactics": [
    "FTA001",
    "FTA002",
    "FTA003",
    "FTA004",
    "FTA005",
    "FTA006",
    "FTA007",
    "FTA009",
    "FTA010",
    "FTA012",
    "FT011.002",
    "FT003",
    "FT006.002",
    "FT048",
    "FT005.001",
    "FT008",
    "FT013",
    "FT016",
    "FT027",
    "FT018"
  ],
  "mitre_f3": [],
  "groupib_stages": [
    "Reconnaissance",
    "Resource Development",
    "Account Access",
    "Defence Evasion",
    "Monetization"
  ],
  "ucff_domains": {
    "commit": "Level 2",
    "assess": "Level 2",
    "plan": "Level 2",
    "act": "Level 3",
    "monitor": "Level 3",
    "report": "Level 2",
    "improve": "Level 2"
  },
  "evidence": [],
  "evidence_count": 0
}