{
  "id": "TP-0015",
  "title": "Employment Fraud via Brand Impersonation",
  "category": "ThreatPath",
  "date": "2026-02-19",
  "author": "FLAME Project",
  "source": "domain_intel DEA investigation / FBI IC3 employment scam advisories",
  "tlp": "WHITE",
  "summary": "Actors impersonate legitimate employers — particularly in healthcare staffing, home care, and remote work sectors — by registering lookalike domains and creating fake job postings. Victims are \"hired\" through a fake onboarding process that harvests PII (SSN, banking info, government ID) for identity theft, or are charged advance fees for equipment, training, or background checks. The FBI IC3 reported $367M in employment fraud losses in 2023, with fake job scams increasing 118% year-over-year. This threat path is distinct from BEC in that the victim is the job applicant, not an employee of the impersonated company.",
  "body": "## Summary\n\nActors impersonate legitimate employers — particularly in healthcare staffing, home care, and remote work sectors — by registering lookalike domains and creating fake job postings. Victims are \"hired\" through a fake onboarding process that harvests PII (SSN, banking info, government ID) for identity theft, or are charged advance fees for equipment, training, or background checks. The FBI IC3 reported $367M in employment fraud losses in 2023, with fake job scams increasing 118% year-over-year. This threat path is distinct from BEC in that the victim is the job applicant, not an employee of the impersonated company.\n\n## Threat Path Hypothesis\n\n> **Hypothesis**: Organized actors are registering domains that impersonate legitimate employers (particularly healthcare staffing agencies), creating fake job listings on major job boards, and using fake hiring processes to harvest PII and extract advance fees from job seekers.\n\n**Confidence**: High — well-documented by FBI IC3, FTC, and directly observed in domain_intel investigation. Infrastructure patterns confirm organized operation.\n**Estimated Impact**: $2,000 – $50,000 per victim (identity theft downstream); potential mass-scale PII harvesting affecting hundreds of applicants per campaign.\n\n## CFPF Phase Mapping\n\n### Phase 1: Recon\n\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| Brand target selection | Identify legitimate employers with active hiring (healthcare staffing, home care agencies, remote-first companies). Monitor job boards for active listings to clone. | Registration of domains similar to legitimate employer names |\n| CFPF-P1-003: Domain infrastructure | Register lookalike domains impersonating target employer. Set up email infrastructure on separate domains for \"HR\" communications. | Bulk domain registration with employer name variations; email domains distinct from web domains (e.g., @newjobrequire.com for multiple \"employers\") |\n| Job board reconnaissance | Study legitimate job postings to create convincing replicas with matching job titles, salary ranges, and requirements. | Cloned job descriptions appearing on multiple boards simultaneously |\n\n### Phase 2: Initial Access\n\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| Fake job posting distribution | Post cloned job listings on Indeed, LinkedIn, ZipRecruiter, and social media. Use legitimate job board infrastructure to gain credibility. | Job postings from newly created employer accounts; postings that redirect to external application portals |\n| CFPF-P2-001: Phishing — fake application portal | Direct applicants to lookalike employer website with online application form. Capture initial PII (name, email, phone, address, work history). | Application portals on recently registered domains; SSL certificates issued within days of first posting |\n| Email-based \"hiring\" contact | Send interview invitations and offer letters from professional-looking email addresses on controlled domains. | HR communications from non-corporate email domains; offers extended without video/phone interview |\n\n### Phase 3: Positioning\n\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| Fake interview process | Conduct text-based \"interviews\" via messaging apps or email (avoid video/voice to prevent identification). May use AI chatbots for initial screening. | Interview conducted entirely via text/chat; interviewer refuses video call; generic interview questions |\n| Offer letter with PII request | Send official-looking offer letter requesting onboarding documentation: SSN, bank account for direct deposit, government ID scan, W-4 form. | Offer letter requesting SSN and banking info before any in-person contact; offer contingent on immediate document submission |\n| Trust building | Reference real company details, benefits packages, and employee handbooks. May create fake employee portals for \"onboarding.\" | Employee portals on non-corporate domains; onboarding materials copied from legitimate employer |\n\n### Phase 4: Execution\n\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| PII harvesting | Collect SSN, banking details, government ID via \"onboarding\" forms. Data used for synthetic identity creation, account takeover, or sold on dark web. | Bulk PII collection without corresponding employment verification; same PII collection infrastructure used across multiple \"employers\" |\n| Advance fee extraction | Charge victim for \"equipment\" (laptop, headset), \"training materials,\" \"background check fees,\" or \"software licenses.\" Payment via wire transfer, gift cards, or crypto. | Equipment fees charged before start date; payment requested via non-refundable methods; \"employer\" ships equipment that never arrives |\n| Check overpayment scheme | Send victim a fraudulent check for \"equipment purchase\" — victim deposits, buys equipment from actor-controlled vendor, check bounces. | Checks from unfamiliar banks; instructions to purchase from specific vendors; urgency around equipment procurement |\n\n### Phase 5: Monetization\n\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| Identity theft | Harvested PII used to open credit accounts, file fraudulent tax returns, or create synthetic identities for bust-out schemes (see TP-0003). | Credit applications using victim's SSN from new addresses; tax returns filed from unexpected states |\n| PII resale | Bulk sale of harvested PII packages (fullz) on dark web marketplaces. | Victim PII appearing in breach databases linked to employment fraud domains |\n| CFPF-P5-002: Advance fee laundering | Fees collected via wire, gift cards, or crypto laundered through mule networks or converted to cryptocurrency. | Mule accounts receiving small wire transfers from multiple victims |\n\n## Look Left / Look Right\n\n**Discovery Phase**: Typically **P3/P4** — victim realizes fraud when \"start date\" passes with no contact, equipment never arrives, or employer's real HR department has no record of the hire.\n\n**Look Left**: Were there earlier signals — the domain was recently registered? The job posting appeared on boards without the employer's knowledge? The email domain didn't match the company's actual domain? Was the interview process unusually text-only?\n\n**Look Right**: Is the same infrastructure being used to impersonate other employers? Are the harvested identities appearing in synthetic identity fraud schemes? Are the same email domains (@newjobrequire.com pattern) being reused across campaigns?\n\n## Controls & Mitigations\n\n| Phase | Control | Type |\n|-------|---------|------|\n| P1 | Brand monitoring for lookalike domain registrations (employer-side) | Detective |\n| P2 | Job board verification of employer accounts and posting authenticity | Preventive |\n| P2 | Browser-based warnings for recently registered domains posing as employers | Detective |\n| P3 | Applicant education: verify offers through company's official website/phone | Preventive |\n| P4 | Payment processor flags for \"equipment fee\" patterns from employment contexts | Detective |\n| P5 | Identity monitoring for applicants who submitted PII to unverified employers | Responsive |\n\n## Detection Approaches\n\n### Domain-Based Detection\n\n```sql\nSELECT d.domain_name, d.creation_date, d.registrar\nFROM recently_registered_domains d\nJOIN mx_records m ON d.domain_id = m.domain_id\nJOIN ssl_certificates s ON d.domain_id = s.domain_id\nWHERE d.domain_name SIMILAR TO '%(health|staffing|rightathome)%'\nAND d.creation_date >= CURRENT_DATE - INTERVAL '90 days'\nAND d.hosting_provider IN ('Hostinger', 'GoDaddy', 'OVH')\nAND m.mx_domain != d.domain_name\nAND s.issuer = 'Let''s Encrypt'\nAND DATEDIFF('day', d.creation_date, s.issue_date) <= 3;\n```\n\n### Job Board Anomaly Detection\n\n```\nFlag job postings where:\n  - Employer account created within 30 days of first posting\n  - Job description text matches known legitimate posting with minor changes\n  - Application redirects to external domain (not employer's known career page)\n  - Multiple postings across locations with identical descriptions\n  - Contact email domain differs from employer's known domain\n```\n\n## Operational Evidence\n\n### EV-TP0015-2026-001: DEA Multi-Cluster Employment Fraud Infrastructure\n\n- **Source**: domain_intel investigation 2026-02-19\n- **Cluster**: 72.167.126.201 (GoDaddy, US), 51.81.93.75 (OVH, US), 84.32.84.32 (Hostinger, LT)\n- **Domain Count**: Multiple domains across 3 hosting providers\n- **Key Indicators**: rightathometx.com impersonating Right at Home healthcare staffing, @newjobrequire.com email infrastructure for HR communications, cross-provider hosting distribution (GoDaddy/OVH US/Hostinger), use of budget shared hosting providers\n- **CFPF Phase Coverage**: P1, P2, P3, P4\n- **Confidence**: High\n- **Summary**: Multi-cluster employment fraud infrastructure impersonating Right at Home, a legitimate healthcare staffing agency. The rightathometx.com domain creates a convincing regional brand presence while @newjobrequire.com provides shared email infrastructure across multiple impersonation campaigns. Distribution across three hosting providers (GoDaddy, OVH US, Hostinger) provides resilience against takedowns. The pattern — brand impersonation domain on one provider, email infrastructure on another, with budget shared hosting throughout — is consistent with organized employment fraud operations targeting healthcare job seekers.\n\n## Analyst Notes\n\nEmployment fraud has surged alongside the normalization of remote work, as job seekers are increasingly accustomed to fully digital hiring processes — making it easier for threat actors to impersonate legitimate employers without in-person interaction. The FTC reported that job scam losses exceeded $500M in 2023, with the median individual loss around $2,000 from advance-fee payments for fake equipment, training, or background checks. A notable variant involves \"task scams\" where victims are recruited for fake online work (product reviews, data entry) and asked to deposit their own funds as \"working capital.\" Brand impersonation is particularly effective against large employers with distributed hiring — the victim assumes a local recruiter is legitimate because the parent brand is well-known. Companies should proactively monitor for fraudulent job postings using their brand and maintain a prominent careers-page warning about known scam patterns.\n\n## References\n\n- FBI IC3: Internet Crime Report 2023 — Employment/Business Fraud\n- FTC: Job Scams Report (2024)\n- Better Business Bureau: Employment Scam Tracker\n- Right at Home: Official careers page (for brand impersonation comparison)\n\n## Revision History\n\n| Date | Author | Change |\n|------|--------|--------|\n| 2026-02-19 | FLAME Project | Initial submission with DEA investigation evidence |\n| 2026-02-28 | FLAME Project | v1.5 enrichment: added Stripe FT3 tactic mappings |",
  "sectors": [
    "healthcare",
    "staffing",
    "employment"
  ],
  "fraud_types": [
    "impersonation",
    "advance-fee-fraud",
    "identity-theft"
  ],
  "tags": [
    "employment-fraud",
    "brand-impersonation",
    "job-scam",
    "advance-fee",
    "pii-harvesting",
    "disposable-email",
    "healthcare-staffing"
  ],
  "cfpf_phases": [
    "P1",
    "P2",
    "P3",
    "P4",
    "P5"
  ],
  "mitre_attack": [
    "T1566.001",
    "T1583.001"
  ],
  "ft3_tactics": [
    "FTA001",
    "FTA002",
    "FTA003",
    "FTA004",
    "FTA005",
    "FTA006",
    "FTA007",
    "FTA009",
    "FTA010",
    "FT052.003",
    "FT026.001",
    "FT018",
    "FT020",
    "FT021",
    "FT016",
    "FT055",
    "FT005.001",
    "FT007.009",
    "FT011.002"
  ],
  "mitre_f3": [],
  "groupib_stages": [
    "Reconnaissance",
    "Resource Development",
    "Trust Abuse",
    "End-user Interaction",
    "Perform Fraud",
    "Monetization"
  ],
  "ucff_domains": {},
  "evidence": [
    {
      "evidence_id": "EV-TP0015-2026-001",
      "title": "DEA Multi-Cluster Employment Fraud Infrastructure",
      "source": "domain_intel investigation 2026-02-19",
      "cluster": "72.167.126.201 (GoDaddy, US), 51.81.93.75 (OVH, US), 84.32.84.32 (Hostinger, LT)",
      "domain_count": "Multiple domains across 3 hosting providers",
      "key_indicators": "rightathometx.com impersonating Right at Home healthcare staffing, @newjobrequire.com email infrastructure for HR communications, cross-provider hosting distribution (GoDaddy/OVH US/Hostinger), use of budget shared hosting providers",
      "cfpf_phase_coverage": "P1, P2, P3, P4",
      "confidence": "High",
      "summary": "Multi-cluster employment fraud infrastructure impersonating Right at Home, a legitimate healthcare staffing agency. The rightathometx.com domain creates a convincing regional brand presence while @newjobrequire.com provides shared email infrastructure across multiple impersonation campaigns. Distribution across three hosting providers (GoDaddy, OVH US, Hostinger) provides resilience against takedowns. The pattern — brand impersonation domain on one provider, email infrastructure on another, with budget shared hosting throughout — is consistent with organized employment fraud operations targeting healthcare job seekers."
    }
  ],
  "evidence_count": 1
}