{
  "id": "TP-0014",
  "title": "Insider-Enabled Account Fraud at Financial Institution",
  "category": "ThreatPath",
  "date": "2026-02-12",
  "author": "FLAME Project",
  "source": "DOJ prosecution records / ACFE / FinCEN SAR data / FDIC enforcement actions",
  "tlp": "WHITE",
  "summary": "Employees of financial institutions abuse their legitimate system access to commit or enable fraud — opening accounts with stolen identities, modifying customer records to facilitate unauthorized transactions, exfiltrating customer data to external fraud rings, or directly siphoning funds. The ACFE estimates that insider fraud accounts for 5% of organizational revenue globally. Financial institution insiders are particularly dangerous because they understand internal controls and know how to avoid triggering detection. Schemes often involve collusion with external actors who provide stolen identities or receive diverted funds.",
  "body": "## Summary\n\nEmployees of financial institutions abuse their legitimate system access to commit or enable fraud — opening accounts with stolen identities, modifying customer records to facilitate unauthorized transactions, exfiltrating customer data to external fraud rings, or directly siphoning funds. The ACFE estimates that insider fraud accounts for 5% of organizational revenue globally. Financial institution insiders are particularly dangerous because they understand internal controls and know how to avoid triggering detection. Schemes often involve collusion with external actors who provide stolen identities or receive diverted funds.\n\n## Threat Path Hypothesis\n\n> **Hypothesis**: Financial institution employees with access to core banking, account management, or claims systems are either independently committing fraud or colluding with external actors to open fraudulent accounts, modify customer data, bypass controls, or directly extract funds — exploiting their knowledge of internal detection mechanisms to operate below detection thresholds.\n\n**Confidence**: High — major category in ACFE, DOJ, and FDIC enforcement data.\n**Estimated Impact**: $50,000 – $10,000,000+ per insider. Long-running schemes compound.\n\n## CFPF Phase Mapping\n\n### Phase 1: Recon\n\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| Internal control mapping | Insider identifies detection thresholds, monitoring gaps, review cadences, and system access boundaries through normal job activity | Unusual access to policy/procedure documentation; queries about audit processes |\n| Customer data harvesting | Insider identifies vulnerable customer accounts — dormant accounts, deceased customers, high-balance accounts with minimal monitoring | Access patterns targeting dormant/low-activity accounts; queries outside normal job scope |\n| External actor recruitment (collusion variant) | Insider connects with external fraud actors who provide stolen identities, receive funds, or fence stolen data | Communications between employee and known fraud actors (often discovered retrospectively) |\n\n### Phase 2: Initial Access\n\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| CFPF-P2-009: Insider access abuse | Insider uses legitimate credentials and system access — no technical compromise needed. Access is authorized; the intent is not. | Employee accessing accounts outside their normal portfolio or branch; off-hours system access; access volume spikes |\n| Fraudulent account opening | Insider opens new accounts using stolen, synthetic, or deceased individual identities — bypassing KYC checks they're responsible for | New accounts with PII matching breach data; accounts where employee is the sole contact; accounts with no customer-initiated activity |\n\n### Phase 3: Positioning\n\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| CFPF-P3-002: Modify account information | Change beneficiary info, contact details, or payment routing on existing customer accounts to redirect funds | Account modifications performed by employee on accounts outside their assignment; modifications with no corresponding customer request |\n| CFPF-P3-006: Increase limits | Override or modify transaction limits, credit limits, or approval thresholds on accounts targeted for exploitation | Limit overrides by employee on accounts with no documented customer request; pattern of limit changes preceding large transactions |\n| CFPF-P3-004: Suppress alerts | Disable customer-facing alerts, SAR filing, or internal monitoring on target accounts | Alert suppression on accounts with subsequent high-risk activity |\n| Customer data exfiltration | Export customer PII, account details, or transaction histories for use by external fraud rings | Bulk data access or export; USB usage; email of customer data to personal accounts; screenshot activity |\n\n### Phase 4: Execution\n\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| CFPF-P4-001: Unauthorized wire/transfer | Initiate wire transfers, ACH payments, or internal transfers from customer accounts to insider-controlled or accomplice accounts | Transfers initiated by employee from customer accounts with no customer authorization; transfers to accounts linked to employee |\n| Fictitious loan origination | Approve loans to fictitious borrowers or inflate appraisals for insider benefit | Loan approvals with minimal documentation; appraisals significantly above market; loans to borrowers connected to employee |\n| CFPF-P4-006: Fraudulent claims (insurance variant) | Insurance employee approves fraudulent claims, inflates settlements, or routes claim payments to accomplice accounts | Claims approved outside normal authority; settlements above comparable averages; claim payments to non-policyholder accounts |\n| Cash manipulation (branch) | Teller or branch employee manipulates cash transactions — skimming, kiting, or fictitious deposits | Cash drawer discrepancies; CTR structuring below $10K; balancing anomalies |\n\n### Phase 5: Monetization\n\n| Technique | Description | Indicators |\n|-----------|-------------|------------|\n| Direct fund diversion | Stolen funds sent to insider's own accounts or immediate family | Transfers to accounts with same surname/address as employee |\n| Accomplice network | Funds routed through accounts of external accomplices | Transfers to accounts that opened at same branch or through same employee |\n| CFPF-P5-004: Cash extraction | Cash withdrawals or cashier's checks to avoid electronic trail | Large cash transactions from manipulated accounts |\n| Data monetization | Exfiltrated customer data sold on dark web or to identity fraud rings | Customer PII appearing in dark web markets traceable to institution's data |\n\n## Look Left / Look Right\n\n**Discovery Phase**: Variable — sometimes detected by internal audit (P3/P4), sometimes by customer complaint (P4), sometimes by SAR filing (P5), sometimes not until employee departure. Average detection time for insider fraud: 18 months (ACFE).\n\n**Look Left**: Were there HR red flags (financial stress, lifestyle changes, behavioral indicators)? Were there access pattern anomalies detectable in SIEM/UEBA that weren't investigated? Did the insider's transactions stay consistently below monitoring thresholds (structuring behavior)?\n\n**Look Right**: How many accounts and customers were affected? Has the exfiltrated data been used in other fraud schemes? Were other employees involved or aware?\n\n## Controls & Mitigations\n\n| Phase | Control | Type |\n|-------|---------|------|\n| P1 | Separation of duties: no single employee can open account + modify details + initiate transactions | Preventive |\n| P2 | UEBA (User and Entity Behavior Analytics): baseline employee access patterns, alert on deviations | Detective |\n| P2 | Access reviews: periodic re-certification of employee access rights; remove access not needed for current role | Preventive |\n| P3 | Dual control for account modifications on high-balance or dormant accounts | Preventive |\n| P3 | DLP (Data Loss Prevention): monitor for bulk data access, USB usage, email of customer data | Detective |\n| P4 | Mandatory vacation policies: require employees to take consecutive days off (allows anomaly detection when cover handles accounts) | Detective |\n| P4 | Transaction peer review: second-party approval for transactions on accounts employee has modified | Preventive |\n| P5 | Post-employment monitoring: watch for account activity connected to recently separated employees | Detective |\n\n## Detection Approaches\n\n**UEBA — Employee Access Anomaly Scoring**\n\n```yaml\ntitle: Anomalous Internal Account Access Volume\nstatus: experimental\ndescription: Detects when an employee accesses 3x their baseline account volume within 24 hours\nlogsource:\n    product: core_banking\n    service: ueba\ndetection:\n    selection:\n        action: \"account_view\"\n    timeframe: 24h\n    condition: selection | count(distinct account_id) by employee_id > 3 * baseline_volume_24h\nlevel: high\ntags:\n    - cfpf.phase2.initial_access\n    - insider.threat\n```\n\n**Graph Analytics — Employee-Account-Beneficiary Relationship**\n\n```\nBuild graph: Employee → Accounts Accessed → Beneficiaries/Transfers\nFlag when:\n  - Beneficiary accounts share attributes with employee (address, phone, name)\n  - Employee-modified accounts show transfer patterns to same destination accounts\n  - Employee opened accounts that subsequently received funds from other employee-serviced accounts\n```\n\n## Analyst Notes\n\nInsider fraud is the hardest threat path to detect because the actor has legitimate access and understands the controls. The CFPF's cross-functional approach is essential here: HR behavioral indicators + IT access monitoring + fraud transaction analytics + audit findings must be correlated. No single team sees the full picture.\n\n**Insurance sector specificity**: At insurance companies, insider risk extends to claims adjusters (inflating settlements), underwriters (approving high-risk policies for kickbacks), and agents (premium diversion per TP-0005). The positioning phase often looks like normal job activity — the key differentiator is the pattern of decisions, not any single event.\n\n## References\n\n- ACFE: Report to the Nations (biennial) — occupational fraud statistics\n- FDIC: Enforcement Decisions (insider fraud)\n- DOJ: Bank fraud prosecution press releases\n- CERT National Insider Threat Center: Common Sense Guide\n\n## Revision History\n\n| Date | Author | Change |\n|------|--------|--------|\n| 2026-02-12 | FLAME Project | Initial submission |",
  "sectors": [
    "banking",
    "credit-union",
    "insurance"
  ],
  "fraud_types": [
    "insider-threat",
    "collusion",
    "account-takeover",
    "data-theft"
  ],
  "tags": [
    "insider",
    "employee-fraud",
    "collusion",
    "customer-data",
    "access-abuse",
    "branch-operations"
  ],
  "cfpf_phases": [
    "P1",
    "P2",
    "P3",
    "P4",
    "P5"
  ],
  "mitre_attack": [
    "T1078",
    "T1530",
    "T1657"
  ],
  "ft3_tactics": [
    "FTA001",
    "FTA002",
    "FTA003",
    "FTA004",
    "FTA005",
    "FTA006",
    "FTA007",
    "FTA008",
    "FTA009",
    "FTA010",
    "FT011.002",
    "FT038",
    "FT003",
    "FT006",
    "FT007.005",
    "FT039.001",
    "FT016",
    "FT028",
    "FT037.002",
    "FT042"
  ],
  "mitre_f3": [],
  "groupib_stages": [
    "Reconnaissance",
    "Account Access",
    "Defence Evasion",
    "Perform Fraud",
    "Monetization",
    "Laundering"
  ],
  "evidence": [],
  "evidence_count": 0
}